In [1]:
import pandas as pd

dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[4,5,6],'c3':[10,11,12],'c4':[13,14,15]}

df = pd.DataFrame(dict_data, index = ['r0','r1','r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   4  10  13
r1   2   5   5  11  14
r2   3   6   6  12  15

In [2]:
ndf = df.sort_values(by = 'c1', ascending = False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   6  12  15
r1   2   5   5  11  14
r0   1   4   4  10  13

In [3]:
ndf2 = df.sort_values(by = 'c1', ascending = True)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   4  10  13
r1   2   5   5  11  14
r2   3   6   6  12  15

In [4]:
ndf3 = df.sort_values(by = ['c1','c3'])
ndf3

    c0  c1  c2  c3  c4
r0   1   4   4  10  13
r1   2   5   5  11  14
r2   3   6   6  12  15

In [5]:
ndf3.iloc[1,3] = 5

In [6]:
ndf3

    c0  c1  c2  c3  c4
r0   1   4   4  10  13
r1   2   5   5   5  14
r2   3   6   6  12  15

In [8]:
# c1열에 대해서 오름차순 정렬한 후, c3열에 대해서 또 오름차순 정렬해보기
ndf4 = ndf3.sort_values(by = ['c1','c3'], ascending = True)
ndf4

# 실패

    c0  c1  c2  c3  c4
r0   1   4   4  10  13
r1   2   5   5   5  14
r2   3   6   6  12  15

In [9]:
# 두번째 시도
ndf5 = ndf3.sort_values(by = 'c1', ascending = True).sort_values(by = 'c3',ascending = True)
ndf5
# 실패. c3열에 대해서 오름차순으로 정렬한 거랑 결과 같게 나옴

    c0  c1  c2  c3  c4
r1   2   5   5   5  14
r0   1   4   4  10  13
r2   3   6   6  12  15